Catalogs/ТипыПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыПодписей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПодписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловияДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УсловияПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>УсловияПодписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГостей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыПодписей/Ext/ManagerModule.bsl
Функция ОписаниеТипаЗначенияУсловия(Объект) Экспорт
	
	Условие = Объект.Условие;	
	
	Если (Условие = Перечисления.УсловияПодписей.Активность) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Активности");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ИнформационныеКарты");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.ТипСкидкиНаценки) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ТипыСкидокНаценок");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.КоличествоГостей) 
		ИЛИ (Условие = Перечисления.УсловияПодписей.Сумма) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Неопределено");
	
КонецФункции // ОипсаниеТипаЗначенияУсловия()

Функция ПроверкаУникальностиПриоритета(Приоритет, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыПодписей.Ссылка
	               |ИЗ
	               |	Справочник.ТипыПодписей КАК ТипыПодписей
	               |ГДЕ
	               |	ТипыПодписей.Актуальность
	               |	И ТипыПодписей.Приоритет = &Приоритет
	               |	И ТипыПодписей.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
